import random
string_01 = 'Жизнь - это то, что с тобой происходит, пока ты строишь планы. Джон Леннон'

#1.1.
print(len(string_01))

#1.2.
print(len(string_01))
#print(string_01.count)

#2
list_1 = [1, 2, 3, 4, 5, 6]
random.shuffle(list_1)
print(list_1)

#3
list_01 = [1, 1, 2, 3, 5, 7, 13, 22, 35, 56, 89, 144, 233, 377, 610, 14, 46, 273, 22, 99, 15, 1000]
print(sum(list_01))
a = 0
for i in list_01:
    if 10 < i < 100 or 200 < i < 500:
        a += 1

    print(a)


#4
students = [
        ['1102', 'Ленин', 'Владимир', 'Ильич', '25.01.2008', 'ЭЭ-162'],
        ['0001', 'Сталин', 'Иосиф', 'Виссарионович', '20.08.2006', 'ЭЭ-161'],
        ['0333', 'Хрущев', 'Никита', 'Сергеевич', '13.02.2008', 'ЭЭ-161'],
        ['4004', 'Брежнев', 'Леонид', 'Ильич', '11.07.2009', 'ЭЭ-163'],
        ['5050', 'Михаил', 'Сергеевич', 'Горбачев', '15.02.2006', 'ЭЭ-163'],
        ['0607', 'Ельцин', 'Борис', 'Николаевич', '02.06.2010', 'ЭЭ-164'],
        ['0095', 'Путин', 'Владими', 'Владимирович', '20.03.2007', 'ЭЭ-164'],
        ['0980', 'Медведев', 'Дмитрий', 'Анатольевич', '28.05.2011', 'ЭЭ-162'],
]

#1.1
a = {}

for item in students:
    students[iten[0]] = a[item[1: ]]
