import random
# zadacha 1

string_01 = "жизнь - это то, что происходит, пока ты строишь планы. Джон Ленон"

print(len(string_01))
print(len(set(string_01)))
print(len("".join(string_01.split())))
print(len(string_01.split()))

string_02 = string_01.split(":")

print(len(set(string_02)))


# zadacha 2

a = random.sample(range(6), 6)
print( a)




# zadacha 3

list_01 = [1,1,2,3,5,7,13,22,35,56,80,144,233,377,610,14,46,273,22,99,1000]
a = 0

for i in list_01:

    if 10<i<100 or 200<i<500:
        a+=i
print(i)

# zadacha 4

students = [
        ['1102', 'Ленин', 'Владимир', 'Ильич', '25.01.2008', 'ЭЭ-162'],
        ['0001', 'Сталин', 'Иосиф', 'Виссарионович', '20.08.2006', 'ЭЭ-161'],
        ['0333', 'Хрущев', 'Никита', 'Сергеевич', '13.02.2008', 'ЭЭ-161'],
        ['4004', 'Брежнев', 'Леонид', 'Ильич', '11.07.2009', 'ЭЭ-163'],
        ['5050', 'Михаил', 'Сергеевич', 'Горбачев', '15.02.2006', 'ЭЭ-163'],
        ['0607', 'Ельцин', 'Борис', 'Николаевич', '02.06.2010', 'ЭЭ-164'],
        ['0095', 'Путин', 'Владими', 'Владимирович', '20.03.2007', 'ЭЭ-164'],
        ['0980', 'Медведев', 'Дмитрий', 'Анатольевич', '28.05.2011', 'ЭЭ-162']

]

new_dict = {}

new_dict = dict.fromkeys([students[0]], [students[1:6]])

# print(new_dict)




