# Игра. Виселица

# Решаем эту задачу с помощью функций 

"""
1. Попыток 10
2. Создать 5 слов. Рандомно вывести одно слово пользователю (количество нижних подчеркиваний)
3. В конце вывести слово - если юзер угадал и если не угадал 
4. Создадите функцию is_game_finished() - которая отвечает за окончание игры.
5. Функция main() - отвечает за логику игры
"""

import random

WORDS = ['Python', 'машина', 'строка']
# random.choice(WORDS)
а
_ а _ _  _ а осталось попыток 12
м
м а _ _ _ а о  осталось попыток 12
м а _ _ _ а осталось попыток 11 
# gfge
def func():
    """
    Функция, отвечающая за ...
    """